<%@ page language="java" import="java.util.*" pageEncoding="gbk"%>
<%@ include file="../../include/header.inc" %>
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
  <head>
    <title>帮助信息</title>
    <%@include file="tou.jsp"%>	
    <style type="text/css">
	<!--
	.ttdd {width:300px;font-size:12px;}
	.ddtt {width:100px;}
	.dt {width:100px;}
	.STYLE5 {color: #3399FF;}
	.STYLE7 {font-size: 15px}
	-->
	</style>
	<style type="text/css">
<!--
.STYLE1 {color: #000000}
.STYLE2 {color: #bd0a01}
.STYLE4 {color: #3399FF; font-size: 15px; }
-->
</style>
  </head>
  <body  >
         <TABLE id=table8 width="900px" border=0>
        <TR>
          <TD align=middle height=36 colspan=2><SPAN style="font-size:30px"
><B>求职防骗技巧</B></SPAN></TD></TR>
        <TR>
          <TD  align=middle height=36 colspan=2>
            <HR SIZE=1>
          </TD></TR>
        <TR>
		

		   <TD><div style="margin-top:0px;margin-left:20px;text-align:center;PADDING:15px;border:1px solid #000066;width:200px;height:80px;font-size:16px;" ><a href="<%=request.getContextPath() %>/jsp/qt/gerenhelp.jsp">访问个人帮助信息</a><br><HR SIZE=1><a href="<%=request.getContextPath() %>/jsp/qt/comhelp.jsp">访问企业帮助信息</a></div></TD><TD><div style="margin-top:20px;text-align:left;font-size:16px;" >为保证你的权益，请认真阅读下列指南： 
            <BR><BR>由于出现不法分子以招聘名义骗取求职者的财物的情况,美好前程招聘网提醒求职者提高警惕，谨防求职受骗！<BR><BR></div></TD></TR>
        <TR>
          <TD bgColor=#00CCCC height=26 colspan=2><B>不法手段主要有几种方式：</B></TD></TR>
        <TR>
          <TD colspan=2>&nbsp;&nbsp;&nbsp;1、不法机构以XX人才市场分部或分公司的名义致电一些人才网求职会员，以包推荐工作为名，收取求职者100-300元推荐费或押金，但事后并不实践承诺，使求职者受骗上当<BR>&nbsp;&nbsp;&nbsp;2、不法分子以公司招聘的名义通知求职者前往珠三角一带（东莞居多）面试，再以公司地处偏僻为由主动派车（多为摩托车）接送，在偏僻处假借要与工作人员联系为由，抢夺求职者手机与财物。 
            <BR>&nbsp;&nbsp;&nbsp;3、不法分子与不法医院、医疗所勾结串通，以"招聘"、"体检"为名，告诉求职者已被录取，要求职者到指定医院体检，再求职者交纳数十、数百不等的体检费用后，或让求职者等待录用通知或说求职者身体不合格，给求职者带来损失。 
            <BR>&nbsp;&nbsp;&nbsp;4、不法份子以各种名义向求职者收取抵押金、服装费、产品押金、风险金、报名费、培训费等各种费用，骗取求职者钱财。 
            <BR>&nbsp;&nbsp;&nbsp;5、不法份子以高薪待遇招聘酒店公关、商务伴游、网络兼职、网络赚钱、电子商务等职位骗取求职者钱财或骗取求职者从事非法传销(包括网络传销)。 
            <BR>&nbsp;&nbsp;&nbsp;6、由于近期刚踏入社会的应届毕业生较多，不法分子会以各种方式骗取毕业生的家庭电话，打电话联系其家长，谎称该求职者在某地发生意外急需用钱，要求其家人将款项汇到某帐号上。 
            <BR>&nbsp;&nbsp;&nbsp;7、特别提醒：近日来很多骗子以某某集团、某某公司等名企名义进行招聘，发布招聘信息只留手机号,自称为项目经理；提醒广大求职者找工作谨慎! 
            特别是没有经验的应届生!&nbsp; 
            <BR>&nbsp;&nbsp;&nbsp;8、<B>以学校、老师等名义骗取学生家庭电话，再骗家里人的钱财。</B><BR>　　此类骗子一般以学校或老师名义给你打电话，以完善档案或其他理由索要你的家庭电话，再以你在外出事或其他理由骗取你家里人的钱财。<B>我们建议：</B>一旦遇到有人（不管对方是什么单位）向你索要你家里电话，请千万慎重，不能完全确定对方身份时，一定不能告诉对方家里电话。如果对方是用手机给你联系的，骗子可能性非常大。千万小心！如果已告诉了对方家庭电话，请立即与家里人联系，叫家里人提高警惕。<BR>&nbsp;&nbsp;&nbsp;9、正规公司巧立名目乱收费<BR>　　据网友反映，这些公司一般有正规的营业执照，但是，招聘的“动机不纯”，他们利用年轻人求职心切的心理，用高薪吸引应聘者上钩，然后急着和你签约，但是，巧立了许多收费项目,如体检费、档案保管费、服装费、登记费、上岗费、押金、手续费、存档费、报名费、保密费、预留职位费、保证金等，名堂繁多。到最后，公司往往告知求职者未被录用。但当求职者想要退回这些费用时，大都被拒绝。</TD></TR>
        <TR>
          <TD bgColor=#00CCCC height=26 colspan=2><FONT 
            color=#ff0000><B>本着对求职者负责的态度，我们郑重提醒求职者</B>：</FONT></TD></TR>
        <TR>
          <TD colspan=2>　　1、我们工作人员不会以手机及我网没有公布的任何电话向求职者联系。如遇到自称我网工作人员 
            向你索取任何信息时，请求职者特别注意：对方电话是否是我网公布的电话，如果不是，必定是骗子，请求职者不要相信。<BR>　　2、填写个人简历时，请不要在规定的表单以外的地方填写你的联系方式，这样会使所有人都看到你的联系方式，从而导致不安全的情况发生；强烈建议求职者只留本人联系电话并保持畅通 
            ，勿长时间关机，若非必要最好不留家庭电话 
            。一旦遇到有人（不管对方是什么单位）向你索要你家里电话，请千万慎重，不能完全确定对方身份时，一定不能告诉对方家里电话。如果对方是用手机给你联系的，骗子可能性非常大。千万小心！如果已告诉了对方家庭电话，请立即与家里人联系，叫家里人提高警惕。<BR><BR>　　3、<FONT 
            color=#ff0000>在接到企业的面试时请特别注意：</FONT><BR>　　（1）、在收到招聘单位的面试邀请电话时，请务必再上招聘网站核实一下这个企业的资料；对方如果用移动电话与你联系时，必须索取对方的固定电话，面试前尽量通过对方的固定电话预约面试时间和了解企业信息。<BR>　　（2）、请认真确认面试地点，正规单位招聘一般会将招聘地点设在单位的办公室、会议室，一些以租用房间作为应聘地点的单位，要警惕；千万别轻信招聘者在指定的街道或酒店接待，应该自己主动找到招聘单位所在办公地址或办事处。<BR>　　（3）、绝大多数招聘单位不会主动派车去接应聘者，应聘时勿与陌生人到偏僻地方，勿将手机等财物借给陌生人。发现被骗应及时报警。 
            <BR><BR>　　4、如遇到单位要求必须体检才能上岗的，<B>请求职者注意</B>：单位不应当指定某某医院，而此类医院也不应该是私立医院或者诊所 
            ；体检费一般是在医院体检时缴纳，不应该是单位代收。如遇到此类情况，请求职者不要相信，并及时与我们联系，发现被骗应及时联系我们。<BR><BR>　　5、<B>拒交各种名义的费用</B>。任何招聘单位，以任何名义向求职者收取 
            体检费、档案保管费、服装费、登记费、上岗费、押金、手续费、存档费、报名费、保密费、预留职位费、保证金等各种费用，都属非法行为。招聘单位培训本单位的职工，也不准收取培训费。求职者遇到此类情况，要坚持拒交，并向招聘单位所在地区举报，以确保自己的合法权益不受侵害。<BR><BR>　　6、<B>不轻信许诺到外地上岗</B>。对外地企业或某某外地分公司、分厂、办事处的高薪招聘，不论其待遇多么好，求职者千万要保持清醒的头脑和高度的警惕，不要轻信他的口头许诺，一是不去，二是到劳动保障部门咨询，并办理相关的手续，否则会吃大亏，被骗工骗钱甚至被人贩子骗卖，悔之晚矣。<BR><BR>　　7、<B>多种途径了解公司背景</B>。在求职者正式进入单位之前，想方设法加强对企业的了解以免误入骗子设下的陷阱。比如：注意招聘单位的营业执照等相关证件。 
            <BR><BR>　　8、<B>掌握劳动法规和相关政策</B>。求职者在求职前或求职过程中，应主动学习一些劳动法规和相关政策，提高自己的求职素质和独立思考的能力；<BR><BR>　　9、<B>谨慎签定劳动合同</B>。与用人企业签合同时，求职者要“三看”：一看企业是否经过工商部门登记以及企业注册的有效期限，否则所签合同无效；二看合同字句是否准确、清楚、完整，不能用缩写、替代或含糊的文字表达；三看劳动合同是否有一些必备内容，包括劳动合同期限、工作内容、劳动保护和劳动条件、劳动报酬、社会保险和福利、劳动纪律、劳动合同终止的条件、违反劳动合同的责任等。必须签书面合同，试用期内也要签合同。<BR><BR>　　10、如果发现有欺骗信息、虚假信息及不良信息出现，请立即投诉，让我们共建诚信招聘网站。<BR>　　　 
            投诉QQ:<IMG height=16 src="<%=request.getContextPath() %>/images/qq.gif" width=16 
            border=0>308692467&nbsp;  
            <IMG height=16 src="<%=request.getContextPath() %>/images/qq.gif" width=16 border=0>123456 &nbsp;  
            电话：18724594508<BR><BR><BR></TD></TR>
			        <TR>
          <TD bgColor=#00CCCC height=26 colspan=2><B>个人会员使用网站的方式：</B></TD></TR>
        <TR>
          <TD colspan=2>&nbsp;&nbsp;&nbsp;1、免费注册: 免费注册求职会员,开始轻松网络求职！
		  <BR>&nbsp;&nbsp;&nbsp;2、填写简历:花一分钟时间填写个人求职简历！ 
           <BR>&nbsp;&nbsp;&nbsp;3、找工作: 按关键字或职位类别搜索您的意向职位!
            <BR>&nbsp;&nbsp;&nbsp;4、投简历:向招聘单位投递简历或直接联系招聘单位！ 
			
			</TD></TR>			
			</TABLE>

<%@include file="wei.jsp"%>	
  </body>
</html>
